# St7ConvertLinksToBeams

Converts selected links into beams.

long St7ConvertLinksToBeams(long uID, long PropNum)
Input Parameters
uID
Strand7 model file ID.

PropNum
Target beam property number.
Dependencies
Selection
Links can be selected using functions in Entity Selection.
Source Action
Assigned using St7SetSourceAction.
Keep Selected
Assigned using St7SetKeepSelect.